УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/CommonForms/РедактированиеДополнительныхСведений/Module.bsl
&НаСервереБезКонтекста
&Вместо("ЗаписатьНаборСвойствВРегистр")
Процедура смарт_ЗаписатьНаборСвойствВРегистр(Знач Ссылка, Знач ЗначенияСвойств)  ////++ смарт:Демичев №921 22.03.2022 Проверяем на Интерактивную запись свойство

	УстановитьПривилегированныйРежим(Истина);

	//++ смарт:Демичев №921 22.03.2022
	ПВХИД = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул","ВИПКлиент");
	//-- смарт:Демичев №921 22.03.2022 	
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДополнительныеСведения");
		ЭлементБлокировки.УстановитьЗначение("Объект", Ссылка);
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Ссылка);
		Набор.Прочитать();
		ТекущиеЗначения = Набор.Выгрузить();
		Для Каждого Строка Из ЗначенияСвойств Цикл
						
			//++ смарт:Демичев №921 22.03.2022
            //Если ПВХИД = Строка.Свойство и  ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
            //						
            //		Если Не РольДоступна("ПолныеПрава") Тогда
            //			
            //			Если Не РольДоступна("смартРазрешитьУстановкуВИППартнеру_ДопСведение") Тогда
            //				
            //			 ВызватьИсключение НСтр("ru = 'Недостаточно прав доступа.
            //                         |
            //                         |Работа с ВИП-Партнерами недоступна'"); 
            //                       	
            //				
            //			КонецЕсли;
            //			
            //		КонецЕсли;
            //		
            //	КонецЕсли;	
			//-- смарт:Демичев №921 22.03.2022 	
					
			Запись = ТекущиеЗначения.Найти(Строка.Свойство, "Свойство");
			Если Запись = Неопределено Тогда
				Запись = ТекущиеЗначения.Добавить();
				Запись.Свойство = Строка.Свойство;
				Запись.Значение = Строка.Значение;
				Запись.Объект   = Ссылка;
			КонецЕсли;
						
			Запись.Значение = Строка.Значение;
			
			Если Не ЗначениеЗаполнено(Запись.Значение)
				Или Запись.Значение = Ложь Тогда
				ТекущиеЗначения.Удалить(Запись);
			КонецЕсли;
		КонецЦикла;
		Набор.Загрузить(ТекущиеЗначения);
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
		
	//// Вставить содержимое метода.
	//ПродолжитьВызов(Ссылка, ЗначенияСвойств);
КонецПроцедуры
